In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
     'day' : ['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017', '1/5/2017', '1/6/2017'],
    'temperature' : [32, 35, 28, 24, 32, 32],
    'windspeed' : [6, 7, 2, 7, 4, 2],
    'event' : ['Rain', 'Sunny', 'Snow', 'Snow', 'Rain', 'Sunny']

}
df = pd.DataFrame(dict1)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           32          2  Sunny

### view data

In [3]:
df.shape

(6, 4)

In [15]:
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [5]:
df.tail()

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           32          2  Sunny

In [6]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [9]:
df.day #individual column

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [11]:
df[['day','event']]

        day  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

### operations on data

In [13]:
df['temperature'].max(),df['temperature'].min()

(35, 24)

In [16]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.500000   4.666667
std       3.885872   2.338090
min      24.000000   2.000000
25%      29.000000   2.500000
50%      32.000000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [17]:
df[df.temperature>=32] #conditional select

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
4  1/5/2017           32          4   Rain
5  1/6/2017           32          2  Sunny

In [19]:
df.set_index('day')

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           32          2  Sunny

In [29]:
df[['day','event']][df['temperature']==df['temperature'].min()]

        day event
3  1/4/2017  Snow

### reading from csv

In [33]:
df = pd.read_csv("stock_data.csv",header=None)
df

          0              1        2      3              4
0  Starting            NaN      NaN    NaN            NaN
1   tickers            eps  revenue  price         people
2     GOOGL          27.82       87    845     larry page
3       WMT           4.61      484     65           n.a.
4      MSFT             -1       85     64     bill gates
5       RIL  not available       50   1023  mukesh ambani
6      TATA            5.6       -1   n.a.     ratan tata

In [41]:
df = pd.read_csv("stock_data.csv", header= 1, nrows=3)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [42]:
df = pd.read_csv("stock_data.csv",header=1, na_values=["not available",'n.a.'])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3     RIL    NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [44]:
# since revenue can't be -1, we need to convert it to NaN, 
# but converting -1 to NaN cause the correct -1 value of eps to change as well.
# therefore,using dictionary

In [55]:
df=pd.read_csv("stock_data.csv", header=1,na_values ={
               'eps':['not available','n.a.'],
               'revenue':['not avaiilable','n.a.',-1],
                'price': ["not available",'n.a.'], 
               'people': ["not available",'n.a.']   
           })
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3     RIL    NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

### writing back to csv

In [58]:
df.to_csv('new.csv',index = False)

In [59]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [60]:
# df.to_csv("new.csv",columns=['tickers','eps'])

In [62]:
df.to_csv("new_csv",header=False)

### reading an excel file

In [64]:
df = pd.read_excel("stock_data.xlsx")
df

  Starting     Unnamed: 1 Unnamed: 2 Unnamed: 3     Unnamed: 4
0  tickers            eps    revenue      price         people
1    GOOGL          27.82         87        845     larry page
2      WMT           4.61        484         65           n.a.
3     MSFT             -1         85         64     bill gates
4      RIL  not available         50       1023  mukesh ambani
5     TATA            5.6         -1       n.a.     ratan tata

### converting na values

In [76]:
def convert_people_cell(cell):
    if cell == 'n.a.':
        return 'sam walton'
    return cell
def covert_eps_cell(cell):
    if cell == 'not available':
        return None
    return cell

In [77]:
df = pd.read_excel("stock_data.xlsx",header=1,converters ={ 'eps': covert_eps_cell, 'people' : convert_people_cell})
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     sam walton
2    MSFT  -1.00       85    64     bill gates
3     RIL    NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

### writing to excel file

In [79]:
df.to_excel("new_excel.xlsx", sheet_name="stocks")

### handling missing data